RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
/***************************************************************************//**
* \file cy_usb_dev.c
* \version 2.10
*
* Provides API implementation of the USBFS device middleware.
*
********************************************************************************
* \copyright
* (c) 2018-2021, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_usb_dev.h"

#if (defined(CY_IP_MXUSBFS) || defined(CY_IP_M0S8USBDSS))


/*******************************************************************************
*                             Internal Macro
*******************************************************************************/

#define GET_CFG_WORD(addr)      CY_USB_DEV_GET_CFG_WORD(addr)
#define VAL2IDX(val)            ( (uint32_t) (val) - 1U)
#define GET_UINT16(lsb, msb)    ((lsb) | (uint16_t) (((uint16_t) (msb)) << 8UL))

/* Decode setup request bmRequestType */
#define SETUP_RQST_RCPT_Pos  (0)
#define SETUP_RQST_RCPT_Msk  (0x1FU)
#define SETUP_RQST_TYPE_Pos  (5)
#define SETUP_RQST_TYPE_Msk  (0x60u)
#define SETUP_RQST_DIR_Pos   (7)
#define SETUP_RQST_DIR_Msk   (0x80U)

/* Setup request layout in the buffer */
#define SETUP_RQST_POS         (0)
#define SETUP_RQST_TYPE_POS    (1)
#define SETUP_VALUE_LSB_POS    (2)
#define SETUP_VALUE_MSB_POS    (3)
#define SETUP_INDEX_LSB_POS    (4)
#define SETUP_INDEX_MSB_POS    (5)
#define SETUP_LENGTH_LSB_POS   (6)
#define SETUP_LENGTH_MSB_POS   (7)

/* Field position in the descriptors */
#define CONFIG_DESCR_LENGTH_LSB_POS     (2)     /* Configuration descriptor length (LSB) byte position */
#define CONFIG_DESCR_LENGTH_MSB_POS     (3)     /* Configuration descriptor length (MSB) byte position */
#define BOS_DESCR_LENGTH_LSB_POS        (2)     /* BOS descriptor length (LSB) byte position */
#define BOS_DESCR_LENGTH_MSB_POS        (3)     /* BOS descriptor length (MSB) byte position */
#define CONFIG_DESCR_ATTRIB_POS         (7)     /* Configuration descriptor attribute byte position */
#define DEVICE_DESCR_ISN_STRING_POS     (16)    /* Position of Serial Number in Device Descriptor */
#define STRING_DESCR_LENGTH_POS         (0)     /* Position inside string descriptor where length is stored */
#define STRING_DESCR_TYPE_POS           (1)     /* Position inside string descriptor where type is stored */

/* bmAttributes in configuration descriptor */
#define CONFIG_ATTR_SELF_POWERED_MASK   (0x40U) /* Configuration attribute Self-Powered mask */
#define CONFIG_ATTR_REMOTE_WAKEUP_MASK  (0x20U) /* Configuration attribute Remote Wakeup mask */

/* Fixed string descriptor indexes */
#define STRING_LANGID_INDEX   (0U)
#define STRING_IMSOS_INDEX    (0xEEU)
#define EXT_OS_DESC_LENGTH_BYTE0_POS    (0x0U)
#define EXT_OS_DESC_LENGTH_BYTE1_POS    (0x1U)
#define EXT_OS_DESC_LENGTH_BYTE2_POS    (0x2U)
#define EXT_OS_DESC_LENGTH_BYTE3_POS    (0x3U)


/*******************************************************************************
*                            Static Functions Prototypes
*******************************************************************************/

static int32_t HandleTimeout(int32_t milliseconds);

#if defined(CY_IP_MXUSBFS)
static void InitSerialNumberString(cy_stc_usb_dev_context_t *context);
#endif /* defined(CY_IP_MXUSBFS)  */

static cy_en_usb_dev_status_t ConvertEndpointStateToStatus(cy_en_usb_dev_ep_state_t epState);

static void BusResetCallback(USBFS_Type *base, struct cy_stc_usbfs_dev_drv_context *drvContext);
static void Ep0SetupCallback(USBFS_Type *base, struct cy_stc_usbfs_dev_drv_context *drvContext);
static void Ep0InCallback   (USBFS_Type *base, struct cy_stc_usbfs_dev_drv_context *drvContext);
static void Ep0OutCallback  (USBFS_Type *base, struct cy_stc_usbfs_dev_drv_context *drvContext);

static cy_en_usb_dev_status_t HandleSetup(cy_stc_usb_dev_context_t *context);
static cy_en_usb_dev_status_t HandleIn   (cy_stc_usb_dev_context_t *context);
static cy_en_usb_dev_status_t HandleOut  (cy_stc_usb_dev_context_t *context);

static void DecodeSetupPacket (uint8_t const *data, cy_stc_usb_dev_setup_packet_t *packet);

static cy_en_usb_dev_status_t HandleStandardRequests (cy_stc_usb_dev_control_transfer_t *transfer,
                                                      cy_stc_usb_dev_context_t *context);
static cy_en_usb_dev_status_t GetDescriptorRequest   (cy_stc_usb_dev_control_transfer_t *transfer,
                                                      cy_stc_usb_dev_context_t *context);
static cy_en_usb_dev_status_t GetConfigurationRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                                      cy_stc_usb_dev_context_t *context);
static cy_en_usb_dev_status_t GetInterfaceRequest    (cy_stc_usb_dev_control_transfer_t *transfer,
                                                      cy_stc_usb_dev_context_t *context);
static cy_en_usb_dev_status_t GetStatusRequest       (cy_stc_usb_dev_control_transfer_t *transfer,
                                                      cy_stc_usb_dev_context_t const *context);
static cy_en_usb_dev_status_t ClearFeatureRequest    (cy_stc_usb_dev_control_transfer_t const *transfer,
                                                      cy_stc_usb_dev_context_t *context);
static cy_en_usb_dev_status_t SetAddressRequest      (cy_stc_usb_dev_control_transfer_t const *transfer,
                                                      cy_stc_usb_dev_context_t *context);
static cy_en_usb_dev_status_t SetConfigurationRequest(cy_stc_usb_dev_control_transfer_t const *transfer,
                                                      cy_stc_usb_dev_context_t *context);
static cy_en_usb_dev_status_t SetInterfaceRequest    (cy_stc_usb_dev_control_transfer_t const *transfer,
                                                      cy_stc_usb_dev_context_t *context);
static cy_en_usb_dev_status_t SetFeatureRequest      (cy_stc_usb_dev_control_transfer_t const *transfer,
                                                      cy_stc_usb_dev_context_t *context);

static cy_en_usb_dev_status_t HandleClassRequests(cy_stc_usb_dev_class_ll_item_t    *curItem,
                                                  cy_stc_usb_dev_control_transfer_t *transfer,
                                                  cy_stc_usb_dev_context_t          *context);
static cy_en_usb_dev_status_t HandleClassRequestsCompleted(cy_stc_usb_dev_class_ll_item_t    *curItem,
                                                           cy_stc_usb_dev_control_transfer_t *transfer,
                                                           cy_stc_usb_dev_context_t          *context);

static cy_en_usb_dev_status_t GetExtOsStringDescriptors(cy_stc_usb_dev_ms_os_string_t const *msOsString,
                                                        cy_stc_usb_dev_control_transfer_t *transfer);
static cy_en_usb_dev_status_t HandleVendorRequests(cy_stc_usb_dev_control_transfer_t *transfer,
                                                   cy_stc_usb_dev_context_t *context);
static cy_en_usb_dev_status_t HandleVendorRequestsCompleted(cy_stc_usb_dev_control_transfer_t *transfer,
                                                            cy_stc_usb_dev_context_t *context);

static cy_en_usb_dev_status_t CallSetInterfaceCallbacks(uint32_t interface,
                                                        uint32_t alternate,
                                                        cy_stc_usb_dev_class_ll_item_t *curItem,
                                                        cy_stc_usb_dev_context_t *context);

static cy_en_usb_dev_status_t ConfigureDataEndpoints(uint32_t config, cy_stc_usb_dev_context_t *context);

