RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
static cy_en_usb_dev_status_t InterfaceRemoveDataEndpoints(uint32_t numEndpoints,
                                          cy_stc_usb_dev_endpoint_t const * const *epsPool,
                                          cy_stc_usb_dev_context_t   *context);

static cy_en_usb_dev_status_t InterfaceAddDataEndpoints(uint32_t numEndpoints,
                                       cy_stc_usb_dev_endpoint_t const * const *epsPool,
                                       cy_stc_usb_dev_context_t   *context);


/*******************************************************************************
* Function Name: Cy_USB_Dev_Init
****************************************************************************//**
*
* Initialize the USB Device stack and underneath USBFS hardware driver.
*
* \param base
* The pointer to the USBFS instance.
*
* \param drvConfig
* The pointer to the USBFS driver configuration structure.
*
* \param drvContext
* The pointer to the USBFS driver context structure allocated by the user.
* The structure is used during the USBFS driver operation for internal
* configuration and data retention. The user must not modify anything in
* this structure.
*
* \param device
* The pointer to the device structure \ref cy_stc_usb_dev_device_t.
*
* \param config
* The pointer to the driver configuration structure \ref cy_stc_usb_dev_config_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for
* internal configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
* \note
* The configuration of USB clocks, pins, and interrupts is not handled by this
* function and must be done on the application level.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_Init(USBFS_Type *base,
                                       struct cy_stc_usbfs_dev_drv_config const *drvConfig,
                                       struct cy_stc_usbfs_dev_drv_context      *drvContext,
                                       cy_stc_usb_dev_device_t  const *device,
                                       cy_stc_usb_dev_config_t  const *config,
                                       cy_stc_usb_dev_context_t       *context)
{
    /* Input parameters verification */
    if ((NULL == device) || (NULL == config)    || (NULL == context) ||
        (NULL == base)   || (NULL == drvConfig) || (NULL == drvContext))
    {
        return CY_USB_DEV_BAD_PARAM;
    }

    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_DRV_HW_ERROR;

    /* Store driver information in device */
    context->drvBase    = base;
    context->drvContext = drvContext;

    /* Set default state */
    context->state   = CY_USB_DEV_DISABLED;
    context->configuration = 0U;
    context->classRoot = NULL;

    /* Configure endpoint 0 buffer */
    context->ControlTransfer.buffer  = config->ep0Buffer;
    context->ControlTransfer.bufferSize = config->ep0BufferSize;

    /* Store link to descriptors */
    context->devDescriptors = device;

    /* Initialize delay function */
    context->handleTimeout = &HandleTimeout;

    /* Initialize event callback */
    context->eventsCallback = NULL;

#if defined(CY_IP_MXUSBFS)

    /* Initialize serial string descriptor and set pointer */
    InitSerialNumberString(context);

#endif /* defined(CY_IP_MXUSBFS)  */

    context->getSerialNumString = NULL;

    /* Initialize vendor-specific callbacks */
    context->vndRequestReceived  = NULL;
    context->vndRequestCompleted = NULL;

    /* Link driver and device context */
    Cy_USBFS_Dev_Drv_SetDevContext(base, context, drvContext);

    /* Configure driver */
    retStatus = (cy_en_usb_dev_status_t) Cy_USBFS_Dev_Drv_Init(base, drvConfig, drvContext);

    if (CY_USB_DEV_SUCCESS == retStatus)
    {
        /* Hook device handlers to be called by driver */
        Cy_USBFS_Dev_Drv_RegisterServiceCallback(base, CY_USB_DEV_BUS_RESET, &BusResetCallback, drvContext);
        Cy_USBFS_Dev_Drv_RegisterServiceCallback(base, CY_USB_DEV_EP0_SETUP, &Ep0SetupCallback, drvContext);
        Cy_USBFS_Dev_Drv_RegisterServiceCallback(base, CY_USB_DEV_EP0_IN,    &Ep0InCallback,    drvContext);
        Cy_USBFS_Dev_Drv_RegisterServiceCallback(base, CY_USB_DEV_EP0_OUT,   &Ep0OutCallback,   drvContext);
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_DeInit
****************************************************************************//**
*
* De-initialize the USB Device stack and underneath hardware driver.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
*******************************************************************************/
void Cy_USB_Dev_DeInit(cy_stc_usb_dev_context_t *context)
{
    Cy_USBFS_Dev_Drv_DeInit(context->drvBase, context->drvContext);

    /* IDe-initialize all callbacks */
    context->classRoot = NULL;
    context->eventsCallback = NULL;
    context->getSerialNumString  = NULL;
    context->vndRequestReceived  = NULL;
    context->vndRequestCompleted = NULL;
}


/*******************************************************************************
* Function Name: HandleTimeout
****************************************************************************//**
*
* Waits for 1 millisecond and returns updated number of milliseconds that remain
* to wait before timeout expires.
*
* \param milliseconds
* Number of milliseconds that remain to wait before timeout expires.
*
* \return
* Updated number of milliseconds remain to wait.
*
*******************************************************************************/
static int32_t HandleTimeout(int32_t milliseconds)
{
    Cy_SysLib_Delay(1U); /* Wait for 1 millisecond */

