RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
    return (milliseconds - 1);
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_Connect
****************************************************************************//**
*
* Enables pull-up on D+ (hardware supports only full-speed device) line to
* signal USB Device connection on USB Bus.
*
* \param blocking
* Wait until device is configured.
*
* \param timeout
* Defines in milliseconds the time for which this function can block.
* If that time expires, the USB Device is disconnected and the function returns.
* To wait forever, pass \ref CY_USB_DEV_WAIT_FOREVER.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_Connect(bool blocking, int32_t timeout, cy_stc_usb_dev_context_t *context)
{
    /* Returns SUCCESS except timeout when timeout is used */
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_SUCCESS;

    context->state = CY_USB_DEV_POWERED;
    Cy_USBFS_Dev_Drv_Enable(context->drvBase, context->drvContext);

    if (blocking)
    {
        if (CY_USB_DEV_WAIT_FOREVER == timeout)
        {
            /* Wait until device is configured */
            while (CY_USB_DEV_CONFIGURED != context->state)
            {
                (void) context->handleTimeout(timeout);
            }
        }
        else
        {
            /* Wait until device is configured or timeout */
            while ((CY_USB_DEV_CONFIGURED != context->state) && (timeout > 0))
            {
                timeout = context->handleTimeout(timeout);
            }

            /* Timeout expired disconnect USB Device */
            if (0 == timeout)
            {
                Cy_USB_Dev_Disconnect(context);
                retStatus = CY_USB_DEV_TIMEOUT;
            }
        }
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_Disconnect
****************************************************************************//**
*
* Disables pull-up on D+ (hardware supports only full-speed device) line to
* signal USB Device disconnection on USB Bus.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
*******************************************************************************/
void Cy_USB_Dev_Disconnect(cy_stc_usb_dev_context_t *context)
{
    Cy_USBFS_Dev_Drv_Disable(context->drvBase, context->drvContext);

    /* Set device in the default state */
    context->state   = CY_USB_DEV_DISABLED;
    context->configuration  = 0U;
}


/*******************************************************************************
* Function Name: ConvertEndpointStateToStatus
****************************************************************************//**
*
* Converts endpoint state to the USB Device status code.
*
* \param epState
* Endpoint state cy_en_usb_dev_ep_state_t.
* The state CY_USB_DEV_EP_IDLE converted to \ref CY_USB_DEV_DRV_HW_DISABLED
* to indicate that current endpoint configuration was changed.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
static cy_en_usb_dev_status_t ConvertEndpointStateToStatus(cy_en_usb_dev_ep_state_t epState)
{
    cy_en_usb_dev_status_t retStatus;

    switch(epState)
    {
        case CY_USB_DEV_EP_COMPLETED:
            retStatus = CY_USB_DEV_SUCCESS;
        break;

        case CY_USB_DEV_EP_PENDING:
            retStatus = CY_USB_DEV_DRV_HW_BUSY;
        break;

        case CY_USB_DEV_EP_IDLE: /* Endpoint configuration is changed */
        case CY_USB_DEV_EP_STALLED:
            retStatus = CY_USB_DEV_DRV_HW_DISABLED;
        break;

        case CY_USB_DEV_EP_INVALID:
        case CY_USB_DEV_EP_DISABLED:
            retStatus = CY_USB_DEV_BAD_PARAM;
        break;

        default:
            retStatus = CY_USB_DEV_BAD_PARAM;
        break;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_AbortEpTransfer
****************************************************************************//**
*
* Aborts pending read or write endpoint operation.
* If there is any bus activity after abort operation requested the function
* waits for its completion or timeout. The timeout is time to transfer
* bulk or interrupt packet of maximum playload size. If this bus activity is
* a transfer to the aborting endpoint the received data is lost and endpoint
* transfer completion callbacks is not invoked.
* After function returns new read or write endpoint operation can be submitted.
*
* \param endpoint
* The data endpoint number.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
* \note
* The abort operation is not supported for ISOC endpoints because
* these endpoints do not have handshake and are always accessible by the
* USB Host. Therefore, abort can cause unexpected behavior.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_AbortEpTransfer(uint32_t endpoint,
                                                  cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus;

    /* Request abort operation, on exit abort complete */
    retStatus = (cy_en_usb_dev_status_t) Cy_USBFS_Dev_Drv_Abort(context->drvBase, endpoint, context->drvContext);

