RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
    if (CY_USB_DEV_SUCCESS != retStatus)
    {
        retStatus = CY_USB_DEV_DRV_HW_ERROR;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_StartReadEp
****************************************************************************//**
*
* Start a reading on a certain endpoint.
*
* \param endpoint
* The OUT data endpoint number.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
* \note
* The read is not allowed for OUT endpoints after SET_CONFIGURATION or
* SET_INTERFACE request therefore this function must be called before reading data
* from OUT endpoints.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_StartReadEp(uint32_t endpoint, cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t   retStatus;
    cy_en_usb_dev_ep_state_t epState;

    epState = Cy_USBFS_Dev_Drv_GetEndpointState(context->drvBase, endpoint, context->drvContext);

    /* Check that endpoint is ready for read operation */
    if ((CY_USB_DEV_EP_IDLE == epState) || (CY_USB_DEV_EP_COMPLETED == epState))
    {
        /* Enable endpoint to be written by host */
        Cy_USBFS_Dev_Drv_EnableOutEndpoint(context->drvBase, endpoint, context->drvContext);

        retStatus = CY_USB_DEV_SUCCESS;
    }
    else
    {
        /* Use endpoint state to get status */
        retStatus = ConvertEndpointStateToStatus(epState);
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_ReadEpBlocking
****************************************************************************//**
*
* Read data received from USB Host from a certain endpoint. Before calling
* this function, \ref Cy_USB_Dev_StartReadEp must be called.
* This function is blocking and returns after successful USB Host transfer,
* or an error or timeout occurred.
*
* \param endpoint
* The OUT data endpoint number.
*
* \param buffer
* The pointer to buffer that stores data that was read. \n
* Allocate buffer using \ref CY_USB_DEV_ALLOC_ENDPOINT_BUFFER macro to make
* it USBFS driver configuration independent (See \ref group_usb_dev_ep_buf_alloc
* for more information).
*
* \param size
* The number of bytes to read.
* This value must be less or equal to endpoint maximum packet size.
*
* \param actSize
* The number of bytes that were actually read.
*
* \param timeout
* Defines in milliseconds the time for which this function can block.
* If that time expires the function returns.
* To wait forever pass \ref CY_USB_DEV_WAIT_FOREVER.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_ReadEpBlocking(uint32_t endpoint, uint8_t *buffer,
                                                 uint32_t size, uint32_t *actSize, int32_t timeout,
                                                 cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t   retStatus = CY_USB_DEV_SUCCESS;
    cy_en_usb_dev_ep_state_t epState;

    /* Get endpoint state before check it */
    epState = Cy_USBFS_Dev_Drv_GetEndpointState(context->drvBase, endpoint, context->drvContext);

    if (CY_USB_DEV_WAIT_FOREVER == timeout)
    {
        /* Wait until transfer is completed */
        while (CY_USB_DEV_EP_PENDING == epState)
        {
            (void) context->handleTimeout(timeout);

            /* Update endpoint state */
            epState = Cy_USBFS_Dev_Drv_GetEndpointState(context->drvBase, endpoint, context->drvContext);
        }
    }
    else
    {
        /* Wait until transfer is completed or for timeout */
        while ((CY_USB_DEV_EP_PENDING == epState) && (timeout > 0))
        {
            timeout = context->handleTimeout(timeout);

            /* Update endpoint state */
            epState = Cy_USBFS_Dev_Drv_GetEndpointState(context->drvBase, endpoint, context->drvContext);
        }

        /* Timeout expired */
        if (0 == timeout)
        {
            /* Abort write operation */
            (void) Cy_USB_Dev_AbortEpTransfer(endpoint, context);
            retStatus = CY_USB_DEV_TIMEOUT;
        }
    }

    /* Clear actual number of read bytes */
    *actSize = 0U;

    /* Read data from endpoint buffer after completion */
    if (CY_USB_DEV_EP_COMPLETED == epState)
    {
        retStatus = (cy_en_usb_dev_status_t)
                        Cy_USBFS_Dev_Drv_ReadOutEndpoint(context->drvBase,
                            endpoint, buffer, size, actSize, context->drvContext);

        if (CY_USB_DEV_SUCCESS != retStatus)
        {
            retStatus = CY_USB_DEV_DRV_HW_ERROR;
        }
    }

    if ((CY_USB_DEV_TIMEOUT != retStatus) && (CY_USB_DEV_DRV_HW_ERROR != retStatus))
    {
        /* Use endpoint state to get status */
        retStatus = ConvertEndpointStateToStatus(epState);
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_ReadEpNonBlocking
****************************************************************************//**
*
* Read data received from USB Host from a certain endpoint. Before calling
* this function, \ref Cy_USB_Dev_StartReadEp must be called.
*
* \param endpoint
* The OUT data endpoint number.
*
* \param buffer
* The pointer to buffer that stores data that was read. \n
* Allocate buffer using \ref CY_USB_DEV_ALLOC_ENDPOINT_BUFFER macro to make
* it USBFS driver configuration independent (See \ref group_usb_dev_ep_buf_alloc
* for more information).
*
* \param size
* The number of bytes to read.
* This value must be less than or equal to endpoint maximum packet size.
*
* \param actSize
* The number of bytes that were actually read.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_ReadEpNonBlocking(uint32_t endpoint, uint8_t *buffer,
                                                    uint32_t size, uint32_t *actSize, cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t   retStatus;
    cy_en_usb_dev_ep_state_t epState;

    epState = Cy_USBFS_Dev_Drv_GetEndpointState(context->drvBase, endpoint, context->drvContext);

    /* Read data from endpoint buffer after completion */
    if (CY_USB_DEV_EP_COMPLETED == epState)
    {
        retStatus = (cy_en_usb_dev_status_t)
                        Cy_USBFS_Dev_Drv_ReadOutEndpoint(context->drvBase,
                            endpoint, buffer, size, actSize, context->drvContext);

