RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
        if (CY_USB_DEV_SUCCESS != retStatus)
        {
            retStatus = CY_USB_DEV_DRV_HW_ERROR;
        }
    }
    else
    {
        /* Clear actual number of read bytes */
        *actSize = 0U;

        /* Use endpoint state to get status */
        retStatus = ConvertEndpointStateToStatus(epState);
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_WriteEpBlocking
****************************************************************************//**
*
* Write data to be transferred to USB Host from a certain endpoint.
* This function is blocking and returns after successful USB Host transfer,
* or an error or timeout occurred.
*
* \param endpoint
* The IN data endpoint number.
*
* \param buffer
* The pointer to the buffer containing data bytes to write. \n
* Allocate buffer using \ref CY_USB_DEV_ALLOC_ENDPOINT_BUFFER macro to make
* it USBFS driver configuration independent (See \ref group_usb_dev_ep_buf_alloc
* for more information).
*
* \param size
* The number of bytes to write.
* This value must be less than or equal to endpoint maximum packet size.
*
* \param timeout
* Defines in milliseconds the time for which this function can block.
* If that time expires, the function returns.
* To wait forever, pass \ref CY_USB_DEV_WAIT_FOREVER.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_WriteEpBlocking(uint32_t endpoint, uint8_t const *buffer,
                                                  uint32_t size, int32_t timeout, cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t   retStatus = CY_USB_DEV_BAD_PARAM;
    cy_en_usb_dev_ep_state_t epState;

    epState = Cy_USBFS_Dev_Drv_GetEndpointState(context->drvBase, endpoint, context->drvContext);

    /* Check that endpoint is ready for write operation */
    if ((CY_USB_DEV_EP_IDLE == epState) || (CY_USB_DEV_EP_COMPLETED == epState))
    {
        retStatus = (cy_en_usb_dev_status_t) Cy_USBFS_Dev_Drv_LoadInEndpoint(context->drvBase,
                                                endpoint, buffer, size, context->drvContext);

        /* Check endpoint load status */
        if (CY_USB_DEV_SUCCESS == retStatus)
        {
            /* Update endpoint state after load operation */
            epState = Cy_USBFS_Dev_Drv_GetEndpointState(context->drvBase, endpoint, context->drvContext);

            if (CY_USB_DEV_WAIT_FOREVER == timeout)
            {
                /* Wait until transfer is completed */
                while (CY_USB_DEV_EP_PENDING == epState)
                {
                    (void) context->handleTimeout(timeout);

                    /* Update endpoint state */
                    epState = Cy_USBFS_Dev_Drv_GetEndpointState(context->drvBase, endpoint, context->drvContext);
                }
            }
            else
            {
                /* Wait until transfer is completed or for timeout */
                while ((CY_USB_DEV_EP_PENDING == epState) && (timeout > 0))
                {
                    timeout = context->handleTimeout(timeout);

                    /* Update endpoint state */
                    epState = Cy_USBFS_Dev_Drv_GetEndpointState(context->drvBase, endpoint, context->drvContext);
                }

                /* Timeout expired */
                if (0 == timeout)
                {
                    /* Abort write operation */
                    (void) Cy_USB_Dev_AbortEpTransfer(endpoint, context);
                    retStatus = CY_USB_DEV_TIMEOUT;
                }
            }
        }
        else
        {
            retStatus = CY_USB_DEV_DRV_HW_ERROR;
        }
    }

    if ((CY_USB_DEV_TIMEOUT != retStatus) && (CY_USB_DEV_DRV_HW_ERROR != retStatus))
    {
        /* Use endpoint state to get status */
        retStatus = ConvertEndpointStateToStatus(epState);
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_WriteEpNonBlocking
****************************************************************************//**
*
* Write data to be transferred to USB Host from a certain endpoint.
*
* \param endpoint
* The IN data endpoint number.
*
* \param buffer
* The pointer to the buffer containing data bytes to write. \n
* Allocate buffer using \ref CY_USB_DEV_ALLOC_ENDPOINT_BUFFER macro to make
* it USBFS driver configuration independent (See \ref group_usb_dev_ep_buf_alloc
* for more information).
*
* \param size
* The number of bytes to write.
* This value must be less than or equal to endpoint maximum packet size.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_WriteEpNonBlocking(uint32_t endpoint, uint8_t const *buffer,
                                                     uint32_t size, cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t   retStatus;
    cy_en_usb_dev_ep_state_t epState;

    epState = Cy_USBFS_Dev_Drv_GetEndpointState(context->drvBase, endpoint, context->drvContext);

    /* Check that endpoint is ready for operation */
    if ((CY_USB_DEV_EP_IDLE == epState) || (CY_USB_DEV_EP_COMPLETED == epState))
    {
        retStatus = (cy_en_usb_dev_status_t)
                        Cy_USBFS_Dev_Drv_LoadInEndpoint(context->drvBase,
                            endpoint, buffer, size, context->drvContext);

        /* Write data into the endpoint buffer */
        if (CY_USB_DEV_SUCCESS != retStatus)

        {
             retStatus = CY_USB_DEV_DRV_HW_ERROR;
        }
    }
    else
    {
        retStatus = ConvertEndpointStateToStatus(epState);
    }

