RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
    return retStatus;
}


/*******************************************************************************
* Function Name: BusResetCallback
****************************************************************************//**
*
* Handles Bus Reset interrupt.
*
* \param base
* The pointer to the USBFS instance.
*
* \param drvContext
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
*******************************************************************************/
static void BusResetCallback(USBFS_Type *base, struct cy_stc_usbfs_dev_drv_context *drvContext)
{
    /* Get device context from the driver context */
    cy_stc_usb_dev_context_t *context = (cy_stc_usb_dev_context_t *) Cy_USBFS_Dev_Drv_GetDevContext(base, drvContext);

    /* Get linked list of classes */
    cy_stc_usb_dev_class_ll_item_t *curItem = context->classRoot;

    /* Set device in the DEFAULT state */
    context->state   = CY_USB_DEV_DEFAULT;
    context->status  = 0U; /* Reset remote wakeup and power state */
    context->configuration = 0U;

    /* Notify Bus Reset event for device instance */
    if (NULL != context->eventsCallback)
    {
        /* Input parameters are zeros. Ignore return for Bus Reset event. */
        (void) context->eventsCallback(CY_USB_DEV_EVENT_BUS_RESET, 0UL, 0UL, context);
    }

    /* Notify Bus Reset event for all class instances */
    while (NULL != curItem)
    {
        if (NULL != curItem->classObj->busReset)
        {
            /* Execute callback */
            curItem->classObj->busReset(curItem->classData, context);
        }

        /* Move to next element */
        curItem = curItem->next;
    }
}


/*******************************************************************************
* Function Name: DecodeSetupPacket
****************************************************************************//**
*
* Decodes setup packet (populates \ref cy_stc_usb_dev_setup_packet_t).
*
* \param data
* The pointer to buffer with setup packet (raw data).
*
* \param packet
* The pointer to structure that holds setup packet.
*
*******************************************************************************/
static void DecodeSetupPacket(uint8_t const *data, cy_stc_usb_dev_setup_packet_t *packet)
{
    /* Fill elements of setup packet structure from raw data */
    packet->bmRequestType.direction = (uint8_t) _FLD2VAL(SETUP_RQST_DIR,  data[SETUP_RQST_POS]);
    packet->bmRequestType.type      = (uint8_t) _FLD2VAL(SETUP_RQST_TYPE, data[SETUP_RQST_POS]);
    packet->bmRequestType.recipient = (uint8_t) _FLD2VAL(SETUP_RQST_RCPT, data[SETUP_RQST_POS]);
    packet->bRequest                = (uint8_t) data[SETUP_RQST_TYPE_POS];
    packet->wValue   = GET_UINT16(data[SETUP_VALUE_LSB_POS],  data[SETUP_VALUE_MSB_POS]);
    packet->wIndex   = GET_UINT16(data[SETUP_INDEX_LSB_POS],  data[SETUP_INDEX_MSB_POS]);
    packet->wLength  = GET_UINT16(data[SETUP_LENGTH_LSB_POS], data[SETUP_LENGTH_MSB_POS]);
}


/*******************************************************************************
* Function Name: HandleSetup
****************************************************************************//**
*
* Handles setup packet received event (generated from Endpoint 0 Interrupt).
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
static cy_en_usb_dev_status_t HandleSetup(cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    cy_stc_usb_dev_control_transfer_t *transfer = &context->ControlTransfer;

    /* Get setup packet from hardware */
    Cy_USBFS_Dev_Drv_Ep0GetSetup(context->drvBase, transfer->buffer, context->drvContext);

    /* Decode setup packet */
    DecodeSetupPacket(transfer->buffer, &transfer->setup);

    /* Prepare for new transfer */
    transfer->ptr       = NULL;
    transfer->remaining = 0U;
    transfer->size      = 0U;
    transfer->direction = transfer->setup.bmRequestType.direction;
    transfer->zlp       = false;
    transfer->notify    = false;

    /* Handle Setup request depends on type */
    switch (transfer->setup.bmRequestType.type)
    {
        case CY_USB_DEV_STANDARD_TYPE:
        case CY_USB_DEV_CLASS_TYPE:
        {
            if (CY_USB_DEV_STANDARD_TYPE == transfer->setup.bmRequestType.type)
            {
                /* Handle Standard requests */
                retStatus = HandleStandardRequests(transfer, context);
            }

            /* Try handle by Class requests handler */
            if (CY_USB_DEV_SUCCESS != retStatus)
            {
                retStatus = HandleClassRequests(context->classRoot, transfer, context);
            }
        }
        break;

        case CY_USB_DEV_VENDOR_TYPE:
            retStatus = HandleVendorRequests(transfer, context);
        break;

        default:
            /* Unknown request type: CY_USB_DEV_REQUEST_NOT_HANDLED */
        break;
    }

    /* Process standard requests */

    /* Continue processing if request was handled */
    if (CY_USB_DEV_SUCCESS == retStatus)
    {
        retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

        /* Check transfer setup before continue transfer */
        if (transfer->setup.bmRequestType.direction == transfer->direction)
        {
            /* Check transfer length */
            if (transfer->setup.wLength > 0U)
            {
                if (CY_USB_DEV_DIR_DEVICE_TO_HOST == transfer->direction)
                {
                    /* IN data stage is required */

                    /* Transfer must be less than or equal to the size requested by the host */
                    if (transfer->remaining > transfer->setup.wLength)
                    {
                        transfer->remaining = transfer->setup.wLength;
                    }

                    retStatus = CY_USB_DEV_SUCCESS;
                }
                else
                {
                    /* OUT data stage is required */

                    /* Transfer must be equal to the size requested by the Host and
                    * buffer for data must be large enough
                    */
                    if ((transfer->remaining == transfer->setup.wLength) &&
                        (transfer->remaining <= transfer->bufferSize))
                    {
                        retStatus = CY_USB_DEV_SUCCESS;
                    }
                }
            }
            else
            {
                /* No data stage: transfer size must be zero */
                if (0U == transfer->remaining)
                {
                    retStatus = CY_USB_DEV_SUCCESS;
                }
            }
        }

        /* Execute transfer if transfer setup correctly */
        if (CY_USB_DEV_SUCCESS == retStatus)
        {
            if (transfer->setup.wLength > 0U)
            {
                /* Data or retStatus stage if applicable */
                if (CY_USB_DEV_DIR_DEVICE_TO_HOST == transfer->direction)
                {
                    /* Define whether send zero length packet at the end of transfer */
                    if (transfer->setup.wLength > transfer->remaining)
                    {
                        /* Transfer is a multiple of EP0 max packet size */
                        transfer->zlp = (0U == (transfer->remaining % Cy_USBFS_Dev_Drv_GetEp0MaxPacket(context->drvBase)));
                    }

                    /* Handle data stage (IN direction) */
                    (void) HandleIn(context);
                }
                else
                {
                    /* Set buffer to accept Host data */
                    transfer->ptr = transfer->buffer;

                    /* Start data stage (OUT direction) */
                    (void) Cy_USBFS_Dev_Drv_Ep0Read(context->drvBase, transfer->ptr, (uint32_t) transfer->remaining, context->drvContext);
                }
            }
            else
            {
                /* No data state: move to status stage (IN direction) */
                (void) Cy_USBFS_Dev_Drv_Ep0Write(context->drvBase, NULL, 0U, context->drvContext);
            }
        }
    }

