RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
    return retStatus;
}


/*******************************************************************************
* Function Name: HandleIn
****************************************************************************//**
*
* Handles IN packet received event (generated from Endpoint 0 Interrupt).
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
static cy_en_usb_dev_status_t HandleIn(cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    cy_stc_usb_dev_control_transfer_t *transfer = &context->ControlTransfer;

    if (CY_USB_DEV_DIR_DEVICE_TO_HOST == transfer->direction)
    {
        /* Data stage (direction IN) */

        /* Send data packet or zero length packet. Skip processing after zero length is sent */
        if (false == ((0U == transfer->remaining) && (!transfer->zlp)))
        {
            if ((transfer->remaining == 0U) && (transfer->zlp))
            {
                /* Zero length packet is send by code below */
                transfer->zlp = false;
            }

            /* Write to endpoint 0 */
            uint16_t packetSize = (uint16_t) Cy_USBFS_Dev_Drv_Ep0Write(context->drvBase,
                                                                       transfer->ptr,
                                                                       (uint32_t) transfer->remaining,
                                                                       context->drvContext);

            /* Update transfer */
            transfer->ptr       += packetSize;
            transfer->remaining -= packetSize;

            /* After last packet has been written move to move to status stage.
            * Do not wait for the next IN event because it can be dropped if
            * ACK from host is corrupted.
            * For more info on this see section 8.5.3.3 of the USB2.0 specification.
            * */
            if ((0U == transfer->remaining) && (transfer->zlp == false))
            {
                /* Data stage completed: move to status stage (direction OUT) */
                (void) Cy_USBFS_Dev_Drv_Ep0Read(context->drvBase, NULL, 0UL, context->drvContext);
            }
        }

        retStatus = CY_USB_DEV_SUCCESS;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: HandleOut
****************************************************************************//**
*
* Handles OUT packet received event (generated from Endpoint 0 Interrupt).
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
static cy_en_usb_dev_status_t HandleOut(cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    cy_stc_usb_dev_control_transfer_t *transfer = &context->ControlTransfer;

    if (CY_USB_DEV_DIR_HOST_TO_DEVICE == transfer->direction)
    {
        /* Control transfer: DATA stage (direction OUT) */

        /* Read from endpoint 0 */
        uint16_t packetSize = (uint16_t) Cy_USBFS_Dev_Drv_Ep0ReadResult(context->drvBase, context->drvContext);

        /* Check whether transfer size is valid */
        if (packetSize <= transfer->remaining)
        {
            /* Update transfer counters */
            transfer->ptr       += packetSize;
            transfer->size      += packetSize;
            transfer->remaining -= packetSize;

            /* Check whether all bytes received */
            if (transfer->remaining > 0U)
            {
                /* Continue: there are more bytes to receive */
                Cy_USBFS_Dev_Drv_Ep0Read(context->drvBase,
                                         transfer->ptr,
                                         (uint32_t) transfer->remaining,
                                         context->drvContext);

                retStatus = CY_USB_DEV_SUCCESS;
            }
            else
            {
                /* Notify class layer DATA stage completed */
                if (transfer->notify)
                {
                    /* Clear notify and reset buffer pointer */
                    transfer->notify = false;
                    transfer->ptr    = transfer->buffer;

                    /* Handle Setup request depends on type */
                    switch(transfer->setup.bmRequestType.type)
                    {
                        case CY_USB_DEV_STANDARD_TYPE:
                            /* Return CY_USB_DEV_REQUEST_NOT_HANDLED because
                            * Standard request handler does not use notification.
                            */
                        break;

                        case CY_USB_DEV_CLASS_TYPE:
                            retStatus = HandleClassRequestsCompleted(context->classRoot, transfer, context);
                        break;

                        case CY_USB_DEV_VENDOR_TYPE:
                            retStatus = HandleVendorRequestsCompleted(transfer, context);
                        break;

                        default:
                            /* Unknown request type: return CY_USB_DEV_REQUEST_NOT_HANDLED */
                        break;
                    }
                }

                if (CY_USB_DEV_SUCCESS == retStatus)
                {
                    /* Move to STATUS stage (direction IN) */
                    (void) Cy_USBFS_Dev_Drv_Ep0Write(context->drvBase, NULL, 0U, context->drvContext);
                }
            }
        }
    }

