RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
    return retStatus;
}


/*******************************************************************************
* Function Name: Ep0SetupCallback
****************************************************************************//**
*
* Implements callback for setup received event (generated from Endpoint 0
* Interrupt). The Endpoint 0 is STALLED if processing was successful.
*
* \param base
* The pointer to the USBFS instance.
*
* \param drvContext
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
*******************************************************************************/
static void Ep0SetupCallback(USBFS_Type *base, struct cy_stc_usbfs_dev_drv_context *drvContext)
{
    /* Get device context from the driver context */
    cy_stc_usb_dev_context_t *context = (cy_stc_usb_dev_context_t *) Cy_USBFS_Dev_Drv_GetDevContext(base, drvContext);

    /* Endpoint 0 setup event */
    if (CY_USB_DEV_SUCCESS != HandleSetup(context))
    {
        /* Protocol stall */
        Cy_USBFS_Dev_Drv_Ep0Stall(base);
    }
}


/*******************************************************************************
* Function Name: Ep0InCallback
****************************************************************************//**
*
* Implements callback for IN packet received event (generated from Endpoint 0
* Interrupt). The Endpoint 0 is STALLED if processing was successful.
*
* \param base
* The pointer to the USBFS instance.
*
* \param drvContext
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
*******************************************************************************/
static void Ep0InCallback(USBFS_Type *base, struct cy_stc_usbfs_dev_drv_context *drvContext)
{
    /* Get device context from the driver context */
    cy_stc_usb_dev_context_t *context = (cy_stc_usb_dev_context_t *) Cy_USBFS_Dev_Drv_GetDevContext(base, drvContext);

    /* Endpoint 0 IN packet received event */
    if (CY_USB_DEV_SUCCESS != HandleIn(context))
    {
        /* Protocol stall */
        Cy_USBFS_Dev_Drv_Ep0Stall(base);
    }
}


/*******************************************************************************
* Function Name: Ep0OutCallback
****************************************************************************//**
*
* Implements callback for OUT packet received event (generated from Endpoint 0
* Interrupt). The Endpoint 0 is STALLED if processing was successful.
*
* \param base
* The pointer to the USBFS instance.
*
* \param drvContext
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
*******************************************************************************/
static void Ep0OutCallback(USBFS_Type *base, struct cy_stc_usbfs_dev_drv_context *drvContext)
{
    /* Get device context from the driver context */
    cy_stc_usb_dev_context_t *context = (cy_stc_usb_dev_context_t *) Cy_USBFS_Dev_Drv_GetDevContext(base, drvContext);

    /* Endpoint 0 OUT packet received */
    if (CY_USB_DEV_SUCCESS != HandleOut(context))
    {
        /* Protocol stall */
        Cy_USBFS_Dev_Drv_Ep0Stall(base);
    }
}

#if defined(CY_IP_MXUSBFS)
/*******************************************************************************
* Function Name: InitSerialNumberString
****************************************************************************//**
*
* Initializes serial number string using silicon ID.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
*******************************************************************************/
static void InitSerialNumberString(cy_stc_usb_dev_context_t *context)
{
    const uint8_t hex[] = "0123456789ABCDEF";
    uint8_t *strDescr = context->serialNumDescr;
    uint8_t *id;
    uint32_t i = 0U;
    uint32_t j = 0U;
    uint64_t tmp;

    /* Place header: length and type */
    strDescr[STRING_DESCR_LENGTH_POS] = CY_USB_DEV_SN_STRING_DESR_LENGTH;
    strDescr[STRING_DESCR_TYPE_POS]   = CY_USB_DEV_STRING_DESCR;

    /* Get unique ID - 8 bytes */
    tmp = Cy_SysLib_GetUniqueId();

    /* Get start address of uint64_t */
    id = (uint8_t *) &tmp;

    /* Fill descriptor using unique silicon ID */
    for (i = 2U; i < CY_USB_DEV_SN_STRING_DESR_LENGTH; i += 4U)
    {
        strDescr[i + 0U] = hex[(id[j] & 0x0FU)];
        strDescr[i + 1U] = 0U;
        strDescr[i + 2U] = hex[(id[j] >> 4U)];
        strDescr[i + 3U] = 0U;
        ++j;
    }
}
#endif /* defined(CY_IP_MXUSBFS)  */

/*******************************************************************************
* Function Name: GetDescriptorRequest
****************************************************************************//**
*
* Handles GET_DESCRIPTOR standard request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t GetDescriptorRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                                   cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

