RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
    switch (CY_USB_DEV_GET_DESCR_TYPE(transfer->setup.wValue))
    {
        case CY_USB_DEV_DEVICE_DESCR:
        {
            /* Return device descriptor */
            transfer->ptr       = (uint8_t *) context->devDescriptors->deviceDescriptor;
            transfer->remaining = CY_USB_DEV_DEVICE_DESCR_LENGTH;

            retStatus = CY_USB_DEV_SUCCESS;
        }
        break;

        case CY_USB_DEV_CONFIG_DESCR:
        {
            /* Get configuration index */
            uint32_t idx = CY_USB_DEV_GET_DESCR_IDX(transfer->setup.wValue);

            /* Check whether requested configuration descriptor exists */
            if (idx < context->devDescriptors->numConfigurations)
            {
                uint8_t *configDescr = (uint8_t *) context->devDescriptors->configurations[idx]->configDescriptor;

                /* Return configuration descriptor */
                transfer->ptr = configDescr;
                transfer->remaining = GET_UINT16(configDescr[CONFIG_DESCR_LENGTH_LSB_POS],
                                                 configDescr[CONFIG_DESCR_LENGTH_MSB_POS]);

                retStatus = CY_USB_DEV_SUCCESS;
            }
        }
        break;

        case CY_USB_DEV_BOS_DESCR:
        {
            uint8_t *bosDescr = (uint8_t *) context->devDescriptors->bosDescriptor;

            /* Check if BOS descriptor exists */
            if (NULL != bosDescr)
            {
                /* Return BOS descriptor */
                transfer->ptr       = bosDescr;
                transfer->remaining = GET_UINT16(bosDescr[BOS_DESCR_LENGTH_LSB_POS],
                                                 bosDescr[BOS_DESCR_LENGTH_MSB_POS]);

                retStatus = CY_USB_DEV_SUCCESS;
            }
        }
        break;

        case CY_USB_DEV_STRING_DESCR:
        {
            uint8_t *strDescr = NULL;

            /* Get string index */
            uint32_t idx = CY_USB_DEV_GET_DESCR_IDX(transfer->setup.wValue);

            /* Get pool of strings */
            cy_stc_usb_dev_string_t const *descr = context->devDescriptors->strings;

            /* Special case: Microsoft OS Descriptors String descriptor */
            if (idx == STRING_IMSOS_INDEX)
            {
                if (NULL != descr->osStringDescriptors)
                {
                    /* Get string */
                    strDescr = (uint8_t *) descr->osStringDescriptors->msOsDescriptor;

                    retStatus = CY_USB_DEV_SUCCESS;
                }
            }
            /* Other string descriptors (included serial number string) */
            else
            {
                /* Check that string exists */
                if ((NULL != descr->stringDescriptors) && (descr->numStrings > 0U) && (idx < descr->numStrings))
                {
                    /* Get string from descriptors */
                    strDescr = (uint8_t *) descr->stringDescriptors[idx];

                    /* Check whether requested string is serial number */
                    if ((idx != STRING_LANGID_INDEX) &&
                        (idx == context->devDescriptors->deviceDescriptor[DEVICE_DESCR_ISN_STRING_POS]))
                    {
                        /* Check options for serial string */
                        if (strDescr != NULL)
                        {
                            /* Serial number is part of device descriptor */
                            retStatus = CY_USB_DEV_SUCCESS;
                        }
                        else
                        {
                            if (context->getSerialNumString != NULL)
                            {
                                /* Get serial number using callback */
                                strDescr = context->getSerialNumString();
                                if (strDescr != NULL)
                                {
                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                            }
                            else
                            {
                                /* Get serial number using silicon ID */
                                strDescr = &context->serialNumDescr[0];
                                retStatus = CY_USB_DEV_SUCCESS;
                            }
                        }
                    }
                    else
                    {
                        retStatus = CY_USB_DEV_SUCCESS;
                    }
                }
            }

            /* Return string if it was found */
            if (CY_USB_DEV_SUCCESS == retStatus)
            {
                /* User defined descriptor */
                transfer->ptr       = strDescr;
                transfer->remaining = strDescr[STRING_DESCR_LENGTH_POS];
            }
        }
        break;

        case CY_USB_DEV_INTERFACE_DESCR:
        case CY_USB_DEV_ENDPOINT_DESCR:
            /* These descriptor types are not supported */
        break;

        default:
            /* The descriptor type was not recognized */
        break;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: GetConfigurationRequest
****************************************************************************//**
*
* Handles SET_CONFIGURATION standard request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t GetConfigurationRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                                      cy_stc_usb_dev_context_t *context)
{
    /* Send the device configuration */
    transfer->ptr       = (uint8_t *) &context->configuration;
    transfer->remaining = (uint16_t)sizeof(context->configuration);

    return CY_USB_DEV_SUCCESS;
}


