RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
/*******************************************************************************
* Function Name: GetInterfaceRequest
****************************************************************************//**
*
* Handles GET_INTERFACE standard request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t GetInterfaceRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                                  cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    uint32_t interface = transfer->setup.wIndex;

    if (CY_USB_DEV_CONFIGURED != context->state)
    {
        return CY_USB_DEV_REQUEST_NOT_HANDLED;
    }

    /* Check whether interface exists in current configuration */
    if (interface < context->devDescriptors->configurations[VAL2IDX(context->configuration)]->numInterfaces)
    {
        /* Return current alternate setting for an interface */
        transfer->ptr       = (uint8_t *) &context->alternate[interface];
        transfer->remaining = (uint16_t)sizeof(context->alternate[interface]);

        retStatus = CY_USB_DEV_SUCCESS;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: GetStatusRequest
****************************************************************************//**
*
* Handles GET_STATUS standard request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t GetStatusRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                               cy_stc_usb_dev_context_t const *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    uint16_t response;

    /* Endpoint or interface must be zero if device is not configured */
    if (context->state != CY_USB_DEV_CONFIGURED)
    {
        if (0U != transfer->setup.wIndex)
        {
            return CY_USB_DEV_REQUEST_NOT_HANDLED;
        }
    }

    /* Find request recipient */
    switch (transfer->setup.bmRequestType.recipient)
    {
        case CY_USB_DEV_RECIPIENT_DEVICE:
        {
            /* Return device status: powered or remote wakeup */
            response = (uint16_t) context->status;
            retStatus   = CY_USB_DEV_SUCCESS;
        }
        break;

        case CY_USB_DEV_RECIPIENT_INTERFACE:
        {
            /* All status bits are Reserved (Reset to zero) */
            response = 0U;
            retStatus   = CY_USB_DEV_SUCCESS;
        }
        break;

        case CY_USB_DEV_RECIPIENT_ENDPOINT:
        {
            uint32_t endpoint = CY_USB_DEV_EPADDR2EP(transfer->setup.wIndex);

            cy_en_usb_dev_ep_state_t epState = Cy_USBFS_Dev_Drv_GetEndpointState(context->drvBase, endpoint, context->drvContext);

            /* Check that valid endpoint is requested */
            if ((CY_USB_DEV_EP_INVALID != epState) && (CY_USB_DEV_EP_DISABLED != epState))
            {
                /* Get endpoint state */
                response  = (CY_USB_DEV_EP_STALLED == epState) ? CY_USB_DEV_ENDPOINT_STATUS_HALT : 0U;
                retStatus = CY_USB_DEV_SUCCESS;
            }
        }
        break;

        default:
        {
            /* Do nothing. */
            break;
        }
    }

    /* Put response into the buffer */
    if (CY_USB_DEV_SUCCESS == retStatus)
    {
        /* Send the status to host */
        transfer->buffer[0U] = CY_LO8(response);
        transfer->buffer[1U] = CY_HI8(response);

        transfer->ptr       = transfer->buffer;
        transfer->remaining = (uint16_t)sizeof(response);
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: ClearFeatureRequest
****************************************************************************//**
*
* Handles CLEAR_FEATURE standard request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t ClearFeatureRequest(cy_stc_usb_dev_control_transfer_t const *transfer,
                                                  cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    /* Endpoint or interface must be zero if device is not configured */
    if (context->state != CY_USB_DEV_CONFIGURED)
    {
        if (transfer->setup.wIndex != 0U)
        {
            return CY_USB_DEV_REQUEST_NOT_HANDLED;
        }
    }

    /* Find request recipient */
    switch (transfer->setup.bmRequestType.recipient)
    {
        case CY_USB_DEV_RECIPIENT_DEVICE:
        {
            /* Check feature selector: TEST_MODE is not supported */
            if (transfer->setup.wValue == CY_USB_DEV_DEVICE_REMOTE_WAKEUP)
            {
                context->status &= (uint8_t) ~CY_USB_DEV_STATUS_REMOTE_WAKEUP_MASK;

                retStatus = CY_USB_DEV_SUCCESS;
            }
        }
        break;

        case CY_USB_DEV_RECIPIENT_INTERFACE:
            /* There is no feature selector this recipient */
        break;

