RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
        case CY_USB_DEV_RECIPIENT_ENDPOINT:
        {
            /* Check that feature selector is ENDPOINT_HALT */
            if (transfer->setup.wValue == CY_USB_DEV_ENDPOINT_HALT)
            {
                uint32_t endpoint = CY_USB_DEV_EPADDR2EP(transfer->setup.wIndex);

                /* Only enabled and data endpoints can be STALLED */
                retStatus = (cy_en_usb_dev_status_t)
                            Cy_USBFS_Dev_Drv_UnStallEndpoint(context->drvBase,
                                endpoint, context->drvContext);

                if (CY_USB_DEV_SUCCESS != retStatus)
                {
                    retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;
                }
            }
        }
        break;

        default:
            /* Unknown recipient */
        break;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: SetAddressRequest
****************************************************************************//**
*
* Handles SET_ADDRESS standard request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t SetAddressRequest(cy_stc_usb_dev_control_transfer_t const *transfer,
                                                cy_stc_usb_dev_context_t *context)
{
    uint8_t devAddress = CY_LO8(transfer->setup.wValue);

    /* Request to change address after status status */
    Cy_USBFS_Dev_Drv_SetAddress(context->drvBase, devAddress, context->drvContext);

    /* Set device state depends on address value */
    context->state = (0U != devAddress) ? CY_USB_DEV_ADDRESSED : CY_USB_DEV_DEFAULT;

    return CY_USB_DEV_SUCCESS;
}


/*******************************************************************************
* Function Name: ConfigureDataEndpoints
****************************************************************************//**
*
* Configures data endpoints that belong to a certain configuration.
*
* \param config
* Configuration index (configuration value - 1).
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of executed operation \ref cy_en_usb_dev_status_t.
* CY_USB_DEV_SUCCESS is returned if no data endpoints are to be configured.
*
*******************************************************************************/
static cy_en_usb_dev_status_t ConfigureDataEndpoints(uint32_t config, cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_SUCCESS;

    uint32_t intf, alt, ep;

    uint32_t numIntr = context->devDescriptors->configurations[config]->numInterfaces;
    cy_stc_usb_dev_interface_t const **descr = context->devDescriptors->configurations[config]->interfaces;

    /* Go through all interfaces that belong to configuration */
    for (intf = 0U; intf < numIntr; ++intf)
    {
        uint32_t mask = context->devDescriptors->configurations[config]->interfaces[intf]->endpointsMask;
        uint32_t endpoint = 1UL;

        /* Use mask to find only endpoints that belong to interface */
        while (0U != mask)
        {
            /* Configure enabled endpoint */
            if (0U != (mask & 0x01U))
            {
                bool configured = false;

                cy_stc_usb_dev_ep_config_t epConfig = {0};

                epConfig.enableEndpoint = false;
                epConfig.allocBuffer    = true;

                /* Go through all alternate */
                for (alt = 0U; alt < descr[intf]->numAlternates; ++alt)
                {
                    /* Go thorough all endpoints that belong to alternate */
                    for (ep = 0U; ep < descr[intf]->alternates[alt]->numEndpoints; ++ep)
                    {
                        cy_stc_usbdev_endpoint_descr_t const *epDescr = (cy_stc_usbdev_endpoint_descr_t const *) ((const void *)(descr[intf]->alternates[alt]->endpoints[ep]->endpointDescriptor));

                        /* Find endpoint that needs to be configured */
                        if (CY_USB_DEV_EPADDR2EP(epDescr->bEndpointAddress) == endpoint)
                        {
                            if (false == configured)
                            {
                                /* Enable endpoint that belongs to alternate 0 */
                                if (0U == alt)
                                {
                                    epConfig.enableEndpoint = true;
                                }

                                /* Initialize endpoint configuration structure */
                                epConfig.endpointAddr   = epDescr->bEndpointAddress;
                                epConfig.attributes     = epDescr->bmAttributes;
                                epConfig.maxPacketSize  = GET_CFG_WORD(&epDescr->wMaxPacketSize);
                                epConfig.bufferSize     = GET_CFG_WORD(&epDescr->wMaxPacketSize);

                                /* Set configuration of the 1st endpoint instance */
                                configured = true;
                            }
                            else
                            {
                                /* Find maximum packet size for this endpoint in all alternates */
                                if (epConfig.bufferSize < GET_CFG_WORD(&epDescr->wMaxPacketSize))
                                {
                                    epConfig.bufferSize = GET_CFG_WORD(&epDescr->wMaxPacketSize);
                                }
                            }

                            break;
                        }
                    }
                }

                /* Add endpoint */
                retStatus = (cy_en_usb_dev_status_t)
                            Cy_USBFS_Dev_Drv_AddEndpoint(context->drvBase,
                                &epConfig, context->drvContext);

                /* Check operation result */
                if (CY_USB_DEV_SUCCESS != retStatus)
                {
                    retStatus = CY_USB_DEV_DRV_HW_ERROR;
                    break;
                }
            }

