RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
            mask >>= 1U;
            ++endpoint;
        }
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: SetConfigurationRequest
****************************************************************************//**
*
* Handles SET_CONFIGURATION standard request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t SetConfigurationRequest(cy_stc_usb_dev_control_transfer_t const *transfer,
                                                      cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    uint32_t config = (uint32_t) transfer->setup.wValue;

    if (0U == config)
    {
        /* Disable all data endpoints */
        Cy_USBFS_Dev_Drv_UnConfigureDevice(context->drvBase, context->drvContext);

        /* Store configuration and move to configured state */
        context->configChanged = true;
        context->configuration = (uint8_t) config;
        context->state  = CY_USB_DEV_ADDRESSED;

        retStatus = CY_USB_DEV_SUCCESS;
    }
    else
    {
        /* Check whether configuration is valid */
        if (config <= context->devDescriptors->numConfigurations)
        {
            uint32_t configIdx = VAL2IDX(config);

            /* Clear context fields that keep configuration related data */
            (void) memset((void *) context->alternate, 0, CY_USB_DEV_NUM_INTERFACES_MAX);

            /* Set device endpoints into the default state before configure them */
            Cy_USBFS_Dev_Drv_UnConfigureDevice(context->drvBase, context->drvContext);

            /* Configure endpoints */
            retStatus = ConfigureDataEndpoints(configIdx, context);

            if (CY_USB_DEV_SUCCESS == retStatus)
            {
                /* Notify Bus Reset event for device instance */
                if (NULL != context->eventsCallback)
                {
                    /* Input parameters are zeros. Ignore return for Bus Reset event. */
                    retStatus = context->eventsCallback(CY_USB_DEV_EVENT_SET_CONFIG, config, 0UL, context);
                }

                if (CY_USB_DEV_SUCCESS == retStatus)
                {
                    /* Get linked list of classes */
                    cy_stc_usb_dev_class_ll_item_t *curItem = context->classRoot;

                    /* Call Set Configuration callback for all class instances */
                    while (NULL != curItem)
                    {
                        if (NULL != curItem->classObj->setConfiguration)
                        {
                            /* Execute callback */
                            retStatus = curItem->classObj->setConfiguration(config, curItem->classData, context);

                            if (CY_USB_DEV_SUCCESS != retStatus)
                            {
                                /* Operation failed break the loop */
                                break;
                            }
                        }

                        /* Move to next element */
                        curItem = curItem->next;
                    }
                }
            }

            if (CY_USB_DEV_SUCCESS == retStatus)
            {
                const uint32_t attribute = context->devDescriptors->configurations[configIdx]->configDescriptor[CONFIG_DESCR_ATTRIB_POS];

                /* Complete device configuration (endpoints were configured) */
                Cy_USBFS_Dev_Drv_ConfigDevice(context->drvBase, context->drvContext);

                /* Set power status (remote wakeup status was cleared on bus reset) */
                if (0U != (attribute & CONFIG_ATTR_SELF_POWERED_MASK))
                {
                    context->status |= (uint8_t) CY_USB_DEV_STATUS_SELF_POWERED_MASK;
                }
                else
                {
                    context->status &= (uint8_t) ~CY_USB_DEV_STATUS_SELF_POWERED_MASK;
                }

                /* Store configuration and move to configured state */
                context->configChanged = true;
                context->configuration = (uint8_t) config;
                context->state  = CY_USB_DEV_CONFIGURED;
            }
            else
            {
                /* Set configuration failed, remain in current state */
                Cy_USBFS_Dev_Drv_UnConfigureDevice(context->drvBase, context->drvContext);

                retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;
            }
        }
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: InterfaceRemoveDataEndpoints
****************************************************************************//**
*
* Disables data endpoints that belong to a certain interface.
*
* \param numEndpoints
* The number of data endpoints.
*
* \param epsPool
* The pointer to pointer to the array of the endpoints.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of executed operation \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
static cy_en_usb_dev_status_t InterfaceRemoveDataEndpoints(uint32_t numEndpoints,
                                             cy_stc_usb_dev_endpoint_t const * const *epsPool,
                                             cy_stc_usb_dev_context_t   *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;
    uint32_t endpoint;

