RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
    if (0U == numEndpoints)
    {
        /* Interface with zero endpoints return success */
        return CY_USB_DEV_SUCCESS;
    }

    /* Remove endpoints that are available in pool */
    for (endpoint = 0UL; endpoint < numEndpoints; ++endpoint)
    {
        /* Get endpoint parsed endpoint descriptor */
        cy_stc_usbdev_endpoint_descr_t const *epDescr = (cy_stc_usbdev_endpoint_descr_t const *)((const void *) (epsPool[endpoint]->endpointDescriptor));

        /* Remove endpoint */
        retStatus = (cy_en_usb_dev_status_t)
                    Cy_USBFS_Dev_Drv_RemoveEndpoint(context->drvBase, (uint32_t) epDescr->bEndpointAddress,
                                                    context->drvContext);

        if (CY_USB_DEV_SUCCESS != retStatus)
        {
            /* Remove operation failed */
            retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;
            break;
        }
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: InterfaceAddDataEndpoints
****************************************************************************//**
*
* Configures data endpoints that belong to a certain interface to operate.
*
* \param numEndpoints
* The number of data endpoints.
*
* \param epsPool
* The pointer to pointer to the array of the endpoints.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
static cy_en_usb_dev_status_t InterfaceAddDataEndpoints(uint32_t numEndpoints,
                                          cy_stc_usb_dev_endpoint_t const *const *epsPool,
                                          cy_stc_usb_dev_context_t   *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;
    uint32_t endpoint;

    if (0U == numEndpoints)
    {
        /* Interface with zero endpoints return success */
        return CY_USB_DEV_SUCCESS;
    }

    /* Add endpoints that are available the pool */
    for (endpoint = 0UL; endpoint < numEndpoints; ++endpoint)
    {
        cy_stc_usbdev_endpoint_descr_t const *epDescr = (cy_stc_usbdev_endpoint_descr_t const *)((const void *) (epsPool[endpoint]->endpointDescriptor));
        cy_stc_usb_dev_ep_config_t epConfig;

        /* Setup configuration structure */
        epConfig.allocBuffer    = false;
        epConfig.enableEndpoint = true;
        epConfig.endpointAddr   = epDescr->bEndpointAddress;
        epConfig.attributes     = epDescr->bmAttributes;
        epConfig.maxPacketSize  = GET_CFG_WORD(&epDescr->wMaxPacketSize);

        /* Add endpoint */
        retStatus = (cy_en_usb_dev_status_t)
                    Cy_USBFS_Dev_Drv_AddEndpoint(context->drvBase, &epConfig,
                        context->drvContext);

        if (CY_USB_DEV_SUCCESS != retStatus)
        {
            /* Add operation failed */
            retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;
            break;
        }
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: CallSetInterfaceCallbacks
****************************************************************************//**
*
* Calls Class callbacks for SET_INTERFACE standard request.
*
* \param interface
* The interface number.
*
* \param alternate
* The alternate setting for the interface.
*
* \param curItem
* The pointer to class linked list element.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t CallSetInterfaceCallbacks(uint32_t interface,
                                                        uint32_t alternate,
                                  cy_stc_usb_dev_class_ll_item_t *curItem,
                                        cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_SUCCESS;

    /* Call registered Set Interface callbacks for all class instances */
    while (NULL != curItem)
    {
        /* Execute callback */
        if (NULL != curItem->classObj->setInterface)
        {
            retStatus = curItem->classObj->setInterface(interface, alternate,
                                                        curItem->classData, context);

            if (CY_USB_DEV_SUCCESS != retStatus)
            {
                break;
            }
        }

        /* Move to next element */
        curItem = curItem->next;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: SetInterfaceRequest
****************************************************************************//**
*
* Handles SET_INTERFACE standard request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t SetInterfaceRequest(cy_stc_usb_dev_control_transfer_t const *transfer,
                                                  cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    uint32_t cfg  = (uint32_t) VAL2IDX(context->configuration);
    uint32_t intf = (uint32_t) transfer->setup.wIndex;
    uint32_t alt  = (uint32_t) transfer->setup.wValue;

    /* Not supported when configuration is set */
    if (CY_USB_DEV_CONFIGURED != context->state)
    {
        return CY_USB_DEV_REQUEST_NOT_HANDLED;
    }

