RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
    /* Check whether interface exists */
    if (intf < context->devDescriptors->configurations[cfg]->numInterfaces)
    {
        /* Check whether alternate for this interface exists */
        if (alt < context->devDescriptors->configurations[cfg]->interfaces[intf]->numAlternates)
        {
            /* Get pointer to interface descriptor structure */
            const cy_stc_usb_dev_interface_t *descr = context->devDescriptors->configurations[cfg]->interfaces[intf];

            /* If alternate settings are not changed, do nothing with current alternate */
            if (alt != context->alternate[intf])
            {
                /* Remove endpoints used by current alternate (old) */
                uint32_t altOld = context->alternate[intf];

                retStatus = InterfaceRemoveDataEndpoints((uint32_t) descr->alternates[altOld]->numEndpoints,
                        (cy_stc_usb_dev_endpoint_t const * const *) descr->alternates[altOld]->endpoints,
                                                          context);

                /* Add endpoints used by new alternate (received) */
                if (CY_USB_DEV_SUCCESS == retStatus)
                {
                    /* Add endpoints used by new alternate (received) */
                    retStatus = InterfaceAddDataEndpoints((uint32_t) descr->alternates[alt]->numEndpoints,
                         (cy_stc_usb_dev_endpoint_t const * const *) descr->alternates[alt]->endpoints,
                                                           context);
                }

                if (CY_USB_DEV_SUCCESS == retStatus)
                {
                    /* Notify Bus Reset event for device instance */
                    if (NULL != context->eventsCallback)
                    {
                        /* Input parameters are zeros. Ignore return for Bus Reset event. */
                        retStatus = context->eventsCallback(CY_USB_DEV_EVENT_SET_INTERFACE, alt, intf, context);
                    }

                    if (CY_USB_DEV_SUCCESS == retStatus)
                    {
                        /* Call Set Interface callbacks for a Class */
                        retStatus = CallSetInterfaceCallbacks(intf, alt, context->classRoot, context);
                    }
                }

                /* Check request complete status */
                if (CY_USB_DEV_SUCCESS == retStatus)
                {
                    /* Store current alternate settings */
                    context->configChanged   = true;
                    context->alternate[intf] = (uint8_t) alt;
                }
            }
            else
            {
                /* Do nothing: current alternate is already set */
                retStatus = CY_USB_DEV_SUCCESS;
            }
        }
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: SetFeatureRequest
****************************************************************************//**
*
* Handles SET_FEATURE standard request.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t SetFeatureRequest(cy_stc_usb_dev_control_transfer_t const *transfer,
                                                cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    /* Endpoint or interface must be zero if device is not configured */
    if (CY_USB_DEV_CONFIGURED != context->state)
    {
        if (0U != transfer->setup.wIndex)
        {
            return CY_USB_DEV_REQUEST_NOT_HANDLED;
        }
    }

    /* Find request recipient */
    switch (transfer->setup.bmRequestType.recipient)
    {
        case CY_USB_DEV_RECIPIENT_DEVICE:
        {
            /* Check feature selector: TEST_MODE is not supported */
            if (CY_USB_DEV_DEVICE_REMOTE_WAKEUP == transfer->setup.wValue)
            {
                context->status |= CY_USB_DEV_STATUS_REMOTE_WAKEUP_MASK;
                retStatus = CY_USB_DEV_SUCCESS;
            }
        }
        break;

        case CY_USB_DEV_RECIPIENT_INTERFACE:
            /* There is no feature selector this recipient */
        break;

        case CY_USB_DEV_RECIPIENT_ENDPOINT:
        {
            /* Check that feature selector is ENDPOINT_HALT */
            if (CY_USB_DEV_ENDPOINT_HALT == transfer->setup.wValue)
            {
                uint32_t endpoint = CY_USB_DEV_EPADDR2EP(transfer->setup.wIndex);

                /* Only enabled and data endpoints can be STALLED */
                retStatus = (cy_en_usb_dev_status_t)
                            Cy_USBFS_Dev_Drv_StallEndpoint(context->drvBase,
                                endpoint, context->drvContext);

                if (CY_USB_DEV_SUCCESS != retStatus)
                {
                    retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;
                }
            }
        }
        break;

        default:
            /* Unknown recipient */
            break;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: HandleStandardRequests
****************************************************************************//**
*
* Handles supported standard requests.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t HandleStandardRequests(cy_stc_usb_dev_control_transfer_t *transfer,
                                                     cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    /* Direction is Device to Host: DATA stage direction is IN */
    if (CY_USB_DEV_DIR_DEVICE_TO_HOST == transfer->direction)
    {
        switch (transfer->setup.bRequest)
        {
            case CY_USB_DEV_RQST_GET_DESCRIPTOR:
                retStatus = GetDescriptorRequest(transfer, context);
            break;

            case CY_USB_DEV_RQST_GET_CONFIGURATION:
                retStatus = GetConfigurationRequest(transfer, context);
            break;

            case CY_USB_DEV_RQST_GET_INTERFACE:
                retStatus = GetInterfaceRequest(transfer, context);
            break;

            case CY_USB_DEV_RQST_GET_STATUS:
                retStatus = GetStatusRequest(transfer, context);
            break;

            default:
            /* Do nothing. */
            break;
        }
    }
    /* Direction is Host to Device: DATA stage direction is OUT or no DATA stage */
    else
    {
        switch (transfer->setup.bRequest)
        {
            case CY_USB_DEV_RQST_SET_ADDRESS:
                retStatus = SetAddressRequest(transfer, context);
            break;

            case CY_USB_DEV_RQST_SET_DESCRIPTOR:
                /* This request is optional and not supported */
            break;

