RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
            case CY_USB_DEV_RQST_SET_CONFIGURATION:
                retStatus = SetConfigurationRequest(transfer, context);
            break;

            case CY_USB_DEV_RQST_SET_INTERFACE:
                retStatus = SetInterfaceRequest(transfer, context);
            break;

            case CY_USB_DEV_RQST_CLEAR_FEATURE:
                retStatus = ClearFeatureRequest(transfer, context);
            break;

            case CY_USB_DEV_RQST_SET_FEATURE:
                retStatus = SetFeatureRequest(transfer, context);
            break;

            default:
            /* Do nothing. */
            break;
        }
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: HandleClassRequests
****************************************************************************//**
*
* Handles supported class requests.
*
* \param curItem
* The pointer to class linked list element.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t HandleClassRequests(cy_stc_usb_dev_class_ll_item_t    *curItem,
                                                  cy_stc_usb_dev_control_transfer_t *transfer,
                                                  cy_stc_usb_dev_context_t          *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    /* Call Request Received callback for all class instances */
    while (NULL != curItem)
    {
        /* Execute callback */
        if (NULL != curItem->classObj->requestReceived)
        {
            retStatus = curItem->classObj->requestReceived(transfer, curItem->classData, context);

            if (CY_USB_DEV_SUCCESS == retStatus)
            {
                /* Request is handled, exit loop */
                break;
            }
        }

        /* Move to next element */
        curItem = curItem->next;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: HandleClassRequestsComplete
****************************************************************************//**
*
* Handles supported class requests completion stage (data was
* received from the USB Host).
*
* \param curItem
* The pointer to class linked list element.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t HandleClassRequestsCompleted(cy_stc_usb_dev_class_ll_item_t    *curItem,
                                                           cy_stc_usb_dev_control_transfer_t *transfer,
                                                           cy_stc_usb_dev_context_t          *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    /* Call Request Complete callback for all class instances */
    while (NULL != curItem)
    {
        /* Execute callback */
        if (NULL != curItem->classObj->requestCompleted)
        {
            retStatus = curItem->classObj->requestCompleted(transfer, curItem->classData, context);

            if (CY_USB_DEV_SUCCESS == retStatus)
            {
                /* Request is handled, exit loop */
                break;
            }
        }

        /* Move to next element */
        curItem = curItem->next;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: GetExtOsStringDescriptors
****************************************************************************//**
*
* Handles supported vendor-specific requests.
*
* \param msOsString
* The pointer to the MS OS String structure \ref cy_stc_usb_dev_ms_os_string_t.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t GetExtOsStringDescriptors(cy_stc_usb_dev_ms_os_string_t const *msOsString,
                                                        cy_stc_usb_dev_control_transfer_t   *transfer)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    /* Direction is Device to Host: DATA stage direction is IN */
    if (CY_USB_DEV_DIR_DEVICE_TO_HOST == transfer->direction)
    {
        if (transfer->setup.bRequest == msOsString->msVendorCode)
        {
            switch(transfer->setup.wIndex)
            {
                case CY_USB_DEV_MS_OS_STRING_EXT_COMPAT_ID:
                case CY_USB_DEV_MS_OS_STRING_EXT_PROPERTEIS:
                {
                    /* Get Extended Compat ID / Properties OS Descriptor (ignores wValue) */
                    uint8_t *strDescr = (uint8_t *) ((CY_USB_DEV_MS_OS_STRING_EXT_COMPAT_ID == transfer->setup.wIndex) ?
                                                  msOsString->extCompatIdDescriptor : msOsString->extPropertiesDescriptor);

                    if (NULL != strDescr)
                    {
                        transfer->ptr = strDescr;
                        transfer->remaining = GET_UINT16(strDescr[EXT_OS_DESC_LENGTH_BYTE0_POS],
                                                         strDescr[EXT_OS_DESC_LENGTH_BYTE1_POS]);

                        retStatus = CY_USB_DEV_SUCCESS;
                    }
                }
                break;

                default:
                /* Do nothing. */
                    break;
            }
        }
    }

