RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.c
    return retStatus;
}


/*******************************************************************************
* Function Name: HandleVendorRequests
****************************************************************************//**
*
* Handles supported vendor-specific requests.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t HandleVendorRequests(cy_stc_usb_dev_control_transfer_t *transfer,
                                                   cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    /* Get pointer to MS OS String descriptor structure */
    const cy_stc_usb_dev_ms_os_string_t *msOsString = context->devDescriptors->strings->osStringDescriptors;

    if (NULL != msOsString)
    {
        retStatus = GetExtOsStringDescriptors(msOsString, transfer);
    }

    if ((CY_USB_DEV_SUCCESS != retStatus) && (NULL != context->vndRequestReceived))
    {
        /* There is no classContext for vendor-specific callbacks */
        retStatus = context->vndRequestReceived(transfer, NULL, context);
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: HandleVendorRequestsComplete
****************************************************************************//**
*
* Handles supported vendor-specific requests completion stage (data was
* received from the USB Host).
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t HandleVendorRequestsCompleted(cy_stc_usb_dev_control_transfer_t *transfer,
                                                            cy_stc_usb_dev_context_t *context)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    if (NULL != context->vndRequestCompleted)
    {
        /* There is no classContext for vendor-specific callbacks */
        retStatus = context->vndRequestCompleted(transfer, NULL, context);
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_RegisterClass
****************************************************************************//**
*
* Registers device class that will be supported by USB Device.
* The USB Device provides a hooks to implement required class support.
*
* \param classItem
* The pointer to class linked list element.
*
* \param classObj
* The pointer to the class structure.
*
* \param classContext
* The pointer to the context class structure allocated by the user.
* The structure is used during the custom class operation for internal
* configuration and data retention.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_RegisterClass(cy_stc_usb_dev_class_ll_item_t *classItem,
                                                cy_stc_usb_dev_class_t *classObj,
                                                void *classContext,
                                                cy_stc_usb_dev_context_t *context)
{
    if ((NULL == classItem) || (NULL == classObj))
    {
        return CY_USB_DEV_BAD_PARAM;
    }

    /* Get linked list of classes */
    cy_stc_usb_dev_class_ll_item_t *curItem = context->classRoot;

    /* Store data members */
    classItem->classObj  = classObj;
    classItem->classData = classContext;
    classItem->next      = NULL;

    if (NULL == curItem)
    {
        /* Add 1st element */
        context->classRoot = classItem;
    }
    else
    {
        /* Find last element */
        while (NULL != curItem->next)
        {
            curItem = curItem->next;
        }

        /* Add current item to the end of the list */
        curItem->next = classItem;
    }

    return CY_USB_DEV_SUCCESS;
}

#endif /* (defined(CY_IP_MXUSBFS) || defined(CY_IP_M0S8USBDSS)) */


/* [] END OF FILE */
